app/controllers/favorites_controller.rb

def create
 favorite = Favorite.find_or_create_by(user_id: current_user.id, show_id: params[:show_id])
 show = Show.find_by(id: params[:show_id])
---
INSERT INTO "favorites" ("user_id", "show_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["show_id", 2], ["created_at", "2016-06-20 21:52:05.551355"], ["updated_at", "2016-06-20 21:52:05.551355"]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 1 AND "favorites"."show_id" = 2 LIMIT 1
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT 1  [["id", 2]]