app/controllers/shows_controller.rb

def index
  @shows = Show.all
---
SELECT "shows".* FROM "shows"