app/controllers/shows_controller.rb

def index
  @shows = Show.order(:title)
---
SELECT "shows".* FROM "shows"  ORDER BY "shows"."title" ASC

def show
  @show = Show.find_by(id: params[:id])
---
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT 1  [["id", 1]]

def search
  cast_size = params[:cast_size]
  length = params[:length]
  show_type = params[:show_type]
  age_of_actors = params[:age_of_actors]
  music_genre = params[:music_genre]
  dance_heavy = params[:dance_heavy]

 @search_results = Show.where(cast_size: cast_size, length: length, show_type: show_type, age_of_actors: age_of_actors, music_genre: music_genre, dance_heavy: dance_heavy)
---
SELECT "shows".* FROM "shows" WHERE "shows"."cast_size" = $1 AND "shows"."length" = $2 AND "shows"."show_type" = $3 AND "shows"."age_of_actors" = $4 AND "shows"."music_genre" = $5 AND "shows"."dance_heavy" = $6  [["cast_size", "medium"], ["length", "one-act"], ["show_type", "book musical"], ["age_of_actors", "children"], ["music_genre", "classic musical theatre"], ["dance_heavy", "false"]]